#include<bits/stdc++.h>
using namespace std;
int f[20][20],n;
//x表示当前还未入栈的数字个数。y表示当前栈中的数字个数。
int main(){
    cin>>n;
    for(int x=0;x<=n;x++){
        for(int y=0;y<=n;y++){
            if(x==0)// 边界：无剩余待入栈数，方案恒为1
                f[x][y]=1;//只能按固定顺序依次出栈，从头到尾只有 1 条路可以走，没有任何别的选择。
            else if(y==0)// 栈空，只能入栈，不能出栈
                f[x][y]=f[x-1][y+1];//也就是：局面 \((x,0)\) 只能一步走到 \((x-1,1)\)。
            else// 既能入栈、也能出栈，两个方案相加
                f[x][y]=f[x-1][y+1]+f[x][y-1];//总方案 = 入栈后续方案 + 出栈后续方案：不就是递归的思想核心么？
        }
    }
    cout<<f[n][0];
}
