#include<bits/stdc++.h>
using namespace std;

char m[12][12];//地图
int f[3];//农夫坐标
int c[3];//奶牛坐标
int ans,tdz;//秒数，专属值

bool zt[160005];//记录专属值是否出现
//我们就可以将初始方向
void move(int x,int y,int mi,int h){//移动函数
    //x,y为x,y坐标，mi为方向：北设为0（初始），顺时针依次将东、南、西设为1，2，3。
    // h为类型：农夫为0，奶牛为1
    if (mi==0){// 向北
        if (m[x-1][y]=='*')  // 前方是障碍
            if (h==0) f[0]=1;// 是农夫，农夫转向东
            else c[0]=1;     // 是牛牛，牛牛转向东
        else //没有遇到障碍
            if (h==0) f[1]--; // 是农夫，农夫向上移动(行号减小)
            else c[1]--; // 是牛牛，牛牛向上移动(行号减小)
    }else if (mi==1){//同上
        if (m[x][y+1]=='*') if (h==0) f[0]=2; else c[0]=2;
        else if (h==0) f[2]++; else c[2]++;
    }else if (mi==2){//同上
        if (m[x+1][y]=='*') if (h==0) f[0]=3; else c[0]=3;
        else if (h==0) f[1]++; else c[1]++;
    }else{//同上
        if (m[x][y-1]=='*') if (h==0) f[0]=0; else c[0]=0;
        else if (h==0) f[2]--; else c[2]--;
    }
}
bool pd(){
    //判断循环终止条件：如果奶牛坐标与农夫坐标相等，则他们重叠，返回0，退出循环
    if (f[1]==c[1]&&f[2]==c[2]) return 0;
    else return 1;
}
int main(){
    //🦖在周围加一圈障碍物(*)
    for (int i=0;i<=11;i++)
        m[i][0]='*',m[i][11]='*';
    for (int i=1;i<=11;i++)
        m[0][i]='*',m[11][i]='*';

    for (int i=1;i<=10;i++){
        for (int j=1;j<=10;j++){
            cin>>m[i][j];
            if (m[i][j]=='F') f[1]=i,f[2]=j;
            if (m[i][j]=='C') c[1]=i,c[2]=j;
        }
    }
    while (pd()){//模拟每秒
        /*
         这是一个哈希编码，将6个变量编码为一个唯一的整数：
            f[1](1-10)：个位
            f[2](1-10)：十位
            c[1](1-10)：百位
            c[2](1-10)：千位
            f[0](0-3)：万位
            c[0](0-3)：四万位
            最大可能值：10 + 10 * 10 + 10 * 100 + 10 * 1000 + 3 * 10000 + 3 * 40000 = 161110
            坐标范围是1-10，用10进制
            方向范围是0-3，用4进制
            这样保证每个状态编码唯一
         */
//        tdz=f[1]+f[2]*10+c[1]*100+c[2]*1000+f[0]*10000+c[0]*40000;//坐标范围是1-10，但编码应该从0开始。原代码直接用1-10，这会导致问题。
// 修正后的编码
        tdz = c[0];                 // 牛方向 0-3 // 1. 初始值 = 牛方向
        tdz = tdz * 4 + f[0];       // 农夫方向 0-3// 2. 乘以4，再加农夫方向
        tdz = tdz * 10 + (f[1] - 1);// 农夫x坐标 0-9 // 3. 乘以10，再加农夫x坐标
        tdz = tdz * 10 + (f[2] - 1);// 农夫y坐标 0-9// 同上
        tdz = tdz * 10 + (c[1] - 1);// 牛x坐标 0-9// 同上
        tdz = tdz * 10 + (c[2] - 1);// 牛y坐标 0-9// 同上

        if (zt[tdz]){//t[tdz]是一个布尔数组，记录某个编码值是否出现过，如果当前状态值 tdz在数组中被标记为 true，说明之前出现过相同的状态
            cout<<0<<endl;
            return 0;
        }
        zt[tdz]=1;//标记
        move(f[1],f[2],f[0],0);
        move(c[1],c[2],c[0],1);//依次移动农夫和奶牛
        ans++;//记录秒数
    }
    cout<<ans<<endl;//输出
    return 0;
}
