/*
注意：C++ 中的数组下标从 0 开始，x 轴是竖直方向，从上到下增大；
 y 轴是水平方向，从左到右增大，与数学中的坐标系不完全相同。
      0   1   2   3   4   5   6   7   8 (y)
    ┌───┬───┬───┬───┬───┬───┬───┬───┐
 0  │   │   │   │   │   │   │   │   │
    ├───┼───┼───┼───┼───┼───┼───┼───┤
 1  │   │   │   │   │   │   │   │   │
    ├───┼───┼───┼───┼───┼───┼───┼───┤
 2  │   │   │   │   │   │   │   │   │
    ├───┼───┼───┼───┼───┼───┼───┼───┤
 3  │   │   │   │   │   │   │   │   │
    ├───┼───┼───┼───┼───┼───┼───┼───┤
 4  │   │   │   │   │   │   │   │   │
    ├───┼───┼───┼───┼───┼───┼───┼───┤
 5  │   │   │   │   │   │   │   │   │
    ├───┼───┼───┼───┼───┼───┼───┼───┤
 6  │   │   │   │   │   │   │   │   │
    ├───┼───┼───┼───┼───┼───┼───┼───┤
 7  │   │   │   │   │   │   │   │   │
    ├───┼───┼───┼───┼───┼───┼───┼───┤
 8  │   │   │   │   │   │   │   │   │
    └───┴───┴───┴───┴───┴───┴───┴───┘
(x)
 数组元素位置表示为 arr[x][y]，其中：
x：行号（竖直方向，从上到下为 0~8）
y：列号（水平方向，从左到右为 0~8）
示例：左上角元素坐标为 (0,0)，对应 arr[0][0]；右下角元素坐标为 (8,8)，对应 arr[8][8]
 * */
#include<bits/stdc++.h>
using namespace std;
int a[20][20];
int main() {
    int n;
    int now = 2, x = 1, y = 1;
    a[1][1] = 1;//数组是从00 开始的但是从11便于分析
    cin >> n;
    while (now <= n * n) {// 循环：直到填充完n²（矩阵所有位置）
        while (y + 1 <= n && a[x][y + 1] == 0) {// 第一步：向右填充（y增加），直到碰到边界或已填充的位置
            y++;
            a[x][y] = now;
            now++;
        }
        while (x + 1 <= n && a[x + 1][y] == 0) {// 第二步：向下填充（x增加），直到碰到边界或已填充的位置
            x++;
            a[x][y] = now;
            now++;
        }
        while (y - 1 >= 1 && a[x][y - 1] == 0) {//左
            y--;
            a[x][y] = now;
            now++;
        }
        while (x - 1 >= 1 && a[x - 1][y] == 0) {//上
            x--;
            a[x][y] = now;
            now++;
        }
    }
    for (int i = 1; i <= n; i++) {
        for (int j = 1; j <= n; j++) {
            //printf("%3d", a[i][j]); // %3d：格式化输出，占3位，不足补空格
            cout << setw(3)<< a[i][j];  // 右对齐，前面补空格
            //cout << left << setw(3) << a[i][j];//左对齐（数字靠左，空格靠右），可以加 left
        }
        cout << endl;
        }
        return 0;
    }
