/*
注意：C++ 中的数组下标从 0 开始，x 轴是竖直方向，从上到下增大；
 y 轴是水平方向，从左到右增大，与数学中的坐标系不完全相同。
      0   1   2   3   4   5   6   7   8 (y)
    ┌───┬───┬───┬───┬───┬───┬───┬───┐
 0  │   │   │   │   │   │   │   │   │
    ├───┼───┼───┼───┼───┼───┼───┼───┤
 1  │   │   │   │   │   │   │   │   │
    ├───┼───┼───┼───┼───┼───┼───┼───┤
 2  │   │   │   │   │   │   │   │   │
    ├───┼───┼───┼───┼───┼───┼───┼───┤
 3  │   │   │   │   │   │   │   │   │
    ├───┼───┼───┼───┼───┼───┼───┼───┤
 4  │   │   │   │   │   │   │   │   │
    ├───┼───┼───┼───┼───┼───┼───┼───┤
 5  │   │   │   │   │   │   │   │   │
    ├───┼───┼───┼───┼───┼───┼───┼───┤
 6  │   │   │   │   │   │   │   │   │
    ├───┼───┼───┼───┼───┼───┼───┼───┤
 7  │   │   │   │   │   │   │   │   │
    ├───┼───┼───┼───┼───┼───┼───┼───┤
 8  │   │   │   │   │   │   │   │   │
    └───┴───┴───┴───┴───┴───┴───┴───┘
(x)
 数组元素位置表示为 arr[x][y]，其中：
x：行号（竖直方向，从上到下为 0~8）
y：列号（水平方向，从左到右为 0~8）
示例：左上角元素坐标为 (0,0)，对应 arr[0][0]；右下角元素坐标为 (8,8)，对应 arr[8][8]
 * */




#include<bits/stdc++.h>
using namespace std;
const int MAX = 40;
int a[MAX][MAX] = {};//初始化所有默认值
int n;
int k = 1, x, y; //k表示第几个数，x,y表示k所在的位置
int main() {
    cin >> n;
    while (k != n * n + 1) {
        if (k == 1) { //特判，最开始时
            x = 1;
            y = n / 2 + 1; //一行的中间位置
        } else if (x == 1 && y != n) {//若 (K-1) 在第一行但不在最后一列，则将 K 填在最后一行，(K-1) 所在列的右一列；
            x = n;
            y++;
        } else if (y == n && x != 1) {//2. 若 (K-1) 在最后一列但不在第一行，则将 K 填在第一列，(K-1) 所在行的上一行；
            x--;
            y = 1;
        } else if (x == 1 && y == n) {//3. 若 (K-1) 在第一行最后一列，则将 K 填在 (K-1) 的正下方；
            x++;
        } else {//4. 若 (K-1) 既不在第一行，也不在最后一列，如果 (K-1) 的右上方还未填数，则将 K 填在 (K-1) 的右上方，否则将 K 填在 E(K-1) 的正下方。
            if (a[x-1][y+1]) {
                x++;
            } else {
                x--;
                y++;
            }
        }
        a[x][y] = k; //填写k
        k++;
    }
    for (int i = 1; i <= n; i++) {
        for (int j = 1; j <= n; j++) {
            cout << a[i][j] << " ";
        }
        cout << "\n";
    }
    return 0;
}
